renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_cmt_rx/src/r_cmt_rx.c
/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/
/* Enum for current mode of CMT channel. */
typedef enum
{
    CMT_RX_MODE_DISABLED = 0,
    CMT_RX_MODE_PERIODIC,
    CMT_RX_MODE_ONE_SHOT
} cmt_modes_t;

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
/* Used to prevent having duplicate code for each channel. This only works if the channels are identical (just at 
   different locations in memory). This is easy to tell by looking in iodefine.h and seeing if the same structure
   was used for all channels. */
static volatile struct st_cmt0 R_BSP_EVENACCESS_SFR * const g_cmt_channels[CMT_RX_NUM_CHANNELS] =
{
/* Currently all RX MCUs have either 2 or 4 CMT channels. */
#if   CMT_RX_NUM_CHANNELS == 4
    /* MCUs have 4 CMT channels. */
    &CMT0, &CMT1, &CMT2, &CMT3
#elif CMT_RX_NUM_CHANNELS == 2
    &CMT0, &CMT1
#else
    #error "Error! r_cmt_rx is not setup for this many CMT channels. Please refer to g_cmt_channels[] in r_cmt_rx.c"
#endif
};

/* Holds current mode of each CMT channel. */
#if BSP_CFG_RTOS_USED == 0      /* Non-OS */
static cmt_modes_t g_cmt_modes[CMT_RX_NUM_CHANNELS];
#elif BSP_CFG_RTOS_USED == 1    /* FreeRTOS */
#if   CMT_RX_NUM_CHANNELS == 4
    #if BSP_CFG_RTOS_SYSTEM_TIMER == 0
        static cmt_modes_t g_cmt_modes[CMT_RX_NUM_CHANNELS] = {CMT_RX_MODE_PERIODIC, CMT_RX_MODE_DISABLED, CMT_RX_MODE_DISABLED, CMT_RX_MODE_DISABLED };
    #elif BSP_CFG_RTOS_SYSTEM_TIMER == 1
        static cmt_modes_t g_cmt_modes[CMT_RX_NUM_CHANNELS] = {CMT_RX_MODE_DISABLED, CMT_RX_MODE_PERIODIC, CMT_RX_MODE_DISABLED, CMT_RX_MODE_DISABLED };
    #elif BSP_CFG_RTOS_SYSTEM_TIMER == 2
        static cmt_modes_t g_cmt_modes[CMT_RX_NUM_CHANNELS] = {CMT_RX_MODE_DISABLED, CMT_RX_MODE_DISABLED, CMT_RX_MODE_PERIODIC, CMT_RX_MODE_DISABLED };
    #elif BSP_CFG_RTOS_SYSTEM_TIMER == 3
        static cmt_modes_t g_cmt_modes[CMT_RX_NUM_CHANNELS] = {CMT_RX_MODE_DISABLED, CMT_RX_MODE_DISABLED, CMT_RX_MODE_DISABLED, CMT_RX_MODE_PERIODIC };
    #else
        #error "Error! Invalid channel"
    #endif
#elif CMT_RX_NUM_CHANNELS == 2
    #if BSP_CFG_RTOS_SYSTEM_TIMER == 0
        static cmt_modes_t g_cmt_modes[CMT_RX_NUM_CHANNELS] = {CMT_RX_MODE_PERIODIC, CMT_RX_MODE_DISABLED };
    #elif BSP_CFG_RTOS_SYSTEM_TIMER == 1
        static cmt_modes_t g_cmt_modes[CMT_RX_NUM_CHANNELS] = {CMT_RX_MODE_DISABLED, CMT_RX_MODE_PERIODIC };
    #else
        #error "Error! Invalid channel"
    #endif
#else
    #error "Error! r_cmt_rx is not setup for this many CMT channels. Please refer to g_cmt_channels[] in r_cmt_rx.c"
#endif
//#elif BSP_CFG_RTOS_USED == 2    /* SEGGER embOS */
//#elif BSP_CFG_RTOS_USED == 3    /* Micrium MicroC/OS */
#elif BSP_CFG_RTOS_USED == 4    /* Renesas RI600V4 & RI600PX */
/* CMT 1 or 2 channels are reserved for System & Trace timer. */
static cmt_modes_t g_cmt_modes[CMT_RX_NUM_CHANNELS] = {
    /*---------- CMT0 initial value ----------*/
#if BSP_CFG_RTOS_SYSTEM_TIMER==0 || _RI_TRACE_TIMER==0
     CMT_RX_MODE_PERIODIC /* CMT0 is reserved for RI600V4/RI600PX. */
#else
     CMT_RX_MODE_DISABLED /* CMT0 is unused. */
#endif
    /*---------- CMT1 initial value ----------*/
#if BSP_CFG_RTOS_SYSTEM_TIMER==1 || _RI_TRACE_TIMER==1
    ,CMT_RX_MODE_PERIODIC  /* CMT1 is reserved for RI600V4/RI600PX. */
#else
    ,CMT_RX_MODE_DISABLED  /* CMT1 is unused. */
#endif
    /*-------------------- 2 pairs of CMT --------------------*/
#if CMT_RX_NUM_CHANNELS > 2
    /*---------- CMT2 initial value ----------*/
#if BSP_CFG_RTOS_SYSTEM_TIMER == 2 || _RI_TRACE_TIMER==2
    ,CMT_RX_MODE_PERIODIC /* CMT2 is reserved for RI600V4/RI600PX. */
#else
    ,CMT_RX_MODE_DISABLED /* CMT2 is unused. */
#endif
    /*---------- CMT3 initial value ----------*/
#if BSP_CFG_RTOS_SYSTEM_TIMER == 3 || _RI_TRACE_TIMER==3
    ,CMT_RX_MODE_PERIODIC  /* CMT3 is reserved for RI600V4/RI600PX. */
#else
    ,CMT_RX_MODE_DISABLED  /* CMT3 is unused. */
#endif
    /*--------------------------------------------------------*/
#endif/* CMT_RX_NUM_CHANNELS */
};
#else /* Non-OS & others */
static cmt_modes_t g_cmt_modes[CMT_RX_NUM_CHANNELS];
#endif/* BSP_CFG_RTOS_USED */

/* This array holds the available clock dividers. For example, if PCLK/8 is available, then '8' would be an entry.
   Note that the index of the divider in the array should correspond to the bit setting used for the CKS[1:0] bitfield.
   For example, 128 is at index 2 in the array and to choose PCLK/128 in the CMCR register you would set the CKS[1:0] 
   bitfield to 2. */
static const uint32_t g_cmt_clock_dividers[] = { 8, 32, 128, 512 };

/* Array that holds user's callback functions. */
static void  (* g_cmt_callbacks[CMT_RX_NUM_CHANNELS])(void * pdata);

/* Internal functions. */
static bool cmt_lock_state(void);
static void cmt_unlock_state(void);
static bool cmt_find_channel(uint32_t * channel);
static void power_on(uint32_t channel);
static void power_off(uint32_t channel);
static void cmt_counter_start(uint32_t channel);
static void cmt_counter_start_priority(uint32_t channel, cmt_priority_t priority);
static void cmt_counter_stop(uint32_t channel);
static bool cmt_setup_channel(uint32_t channel, uint32_t frequency_hz);
static void cmt_isr_common(uint32_t channel);
static bool cmt_create(uint32_t frequency_hz, void (* callback)(void * pdata), cmt_modes_t mode, uint32_t * channel);
static bool cmt_create_priority(uint32_t frequency_hz, void (* callback)(void * pdata), cmt_modes_t mode, uint32_t channel, cmt_priority_t priority);

/***********************************************************************************************************************
* Function Name: R_CMT_CreatePeriodic
********************************************************************************************************************//**
* @brief This function finds an unused CMT channel, configures it for the requested frequency,
* associates a user callback function with the timer’s interrupt, and powers up and starts the timer
* @param[in] frequency_hz Desired frequency in Hz. The range and resolution of the timer is determined by settings of the peripheral clock.
* The best pre-scaler for the CMT channel is chosen by the driver.\n
* @param[in] callback Pointer to the user’s callback function.  It should receive a single void * argument.\n
* @param[in] *channel The CMT FIT module finds the first CMT channel that is not in use and assigns it to the caller.
* This allows multiple drivers to use the CMT driver without having to pre-assign all timer channels.
* This argument provides a way for the driver to indicate back to the caller which channel has been assigned.\n
* @retval true  Successful; CMT initialized
* @retval false     No free CMT channels available, or invalid settings
* @details The R_CMT_CreatePeriodic function finds an unused CMT channel, assigns it to the caller,
* and registers a user callback function to be called upon compare match events.\n
* The CMT is configured to generate compare matches at the frequency specified in the call.\n
* @note 1.  Maximum periodic frequency\n
* In hardware, the CMT timer maximum clocking speed is limited to PCLK/8.
* However, when using the periodic timer function to generate a clock, be aware that interrupt and callback processing takes some time.
* As requested frequency rises, interrupt and callback processing will take an increasing percentage of the processor’s time.
* At some point, too much time is consumed to leave any time for other useful work.
* So this will limit the maximum frequency that can be generated.
*  The maximum practical frequency will depend on your system design, but in general, frequencies up to a few kilohertz are reasonable.\n
*/
bool R_CMT_CreatePeriodic (uint32_t frequency_hz, void (* callback)(void * pdata), uint32_t * channel)
{
    return cmt_create(frequency_hz, callback, CMT_RX_MODE_PERIODIC, channel);
} 
/* End of function R_CMT_CreatePeriodic */

