renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_cmt_rx/src/r_cmt_rx.c
/***********************************************************************************************************************
* Function Name: R_CMT_CreatePeriodicAssignChannelPriority
* ******************************************************************************************************************//**
* @brief This function configures desired CMT channel for the requested frequency and desired interrupt priority level,
* associates a user callback function with the timer’s interrupt, powers up and starts the timer
* @param[in] frequency_hz Desired frequency in Hz. The range and resolution of the timer is determined by settings of the peripheral clock.
* The best pre-scaler for the CMT channel is chosen by the driver.\n
* @param[in] callback Pointer to the user’s callback function. It should receive a single void * argument.\n
* @param[in] channel Desired CMT channel that is used to configure.\n
* @param[in] priority Desired priority level of timer’s interrupt:\n
* CMT_PRIORITY_0: Interrupt is disabled\n
* CMT_PRIORITY_1: Lowest interrupt priority\n
* CMT_PRIORITY_2\n
* CMT_PRIORITY_3\n
* CMT_PRIORITY_4\n
* CMT_PRIORITY_5\n
* CMT_PRIORITY_6\n
* CMT_PRIORITY_7\n
* CMT_PRIORITY_8\n
* CMT_PRIORITY_9\n
* CMT_PRIORITY_10\n
* CMT_PRIORITY_11\n
* CMT_PRIORITY_12\n
* CMT_PRIORITY_13\n
* CMT_PRIORITY_14\n
* CMT_PRIORITY_15: Highest interrupt priority\n
* @retval true  Successful; CMT initialized\n
* @retval false     No free CMT channels available, or invalid settings\n
* @details The R_CMT_CreatePeriodicAssignChannelPriority assigns desired CMT channel to the caller with desired
* interrupt priority level and registers a user callback function to be called upon compare match events.
* The CMT is configured to generate compare matches at the frequency specified in the call.\n
* @note 1.  Maximum periodic frequency\n
* In hardware, the CMT timer maximum clocking speed is limited to PCLK/8.
* However, when using the periodic timer function to generate a clock, be aware that interrupt and callback processing takes some time.
* As requested frequency rises, interrupt and callback processing will take an increasing percentage of the processor’s time.
* At some point, too much time is consumed to leave any time for other useful work.
* So this will limit the maximum frequency that can be generated.
*  The maximum practical frequency will depend on your system design, but in general, frequencies up to a few kilohertz are reasonable.\n
*/
bool R_CMT_CreatePeriodicAssignChannelPriority (uint32_t frequency_hz, void (* callback)(void * pdata), uint32_t channel, cmt_priority_t priority)
{
    return cmt_create_priority(frequency_hz, callback, CMT_RX_MODE_PERIODIC, channel, priority);
}
/* End of function R_CMT_CreatePeriodicAssignChannelPriority */

/***********************************************************************************************************************
* Function Name: R_CMT_CreateOneShot
* ******************************************************************************************************************//**
 @brief This function finds an unused CMT channel, configures it for the requested period,
* associates a user callback function with the timer’s interrupt, and powers up and starts the timer
* @param[in] period_us Desired period in microseconds.
* The range and resolution of the timer is determined by settings of the peripheral clock.
* The best pre-scaler for the CMT channel is chosen by the driver.\n
* @param[in] callback Pointer to the user’s callback function.  It should data a single void * argument.\n
* @param[in] channel The CMT FIT module finds the first CMT channel that is not in use and assigns it to the caller.
* This allows multiple drivers to use the CMT driver without having to pre-assign all timer channels.
* This argument provides a way for the driver to indicate back to the caller which channel has been assigned.\n
* @retval true  Successful; CMT initialized\n
* @retval false     No free CMT channels available, or invalid settings\n
* @details The R_CMT_CreateOneShot function finds an unused CMT channel, assigns it to the caller,
*  and registers a user callback function to be called upon the compare match event.\n
* The CMT is configured to generate a compare match after the period specified in the call.
* The timer is shut down after a single compare match event.\n
*/
bool R_CMT_CreateOneShot (uint32_t period_us, void (* callback)(void * pdata), uint32_t * channel)
{    
    return cmt_create((1000000/period_us), callback, CMT_RX_MODE_ONE_SHOT, channel);
}
/* End of function R_CMT_CreateOneShot */

/***********************************************************************************************************************
* Function Name: R_CMT_CreateOneShotAssignChannelPriority
********************************************************************************************************************//**
* @brief This function configures the desired CMT channel for the requested period with desired interrupt priority level,
* associates a user callback function with the timer’s interrupt, powers up and starts the timer
* @param[in] period_us Desired period in microseconds.
* The range and resolution of the timer is determined by settings of the peripheral clock.
* The best pre-scaler for the CMT channel is chosen by the driver.\n
* @param[in] callback Pointer to the user’s callback function. It should data a single void * argument.\n
* @param[in] channel Desired CMT channel that is used to configure.\n
* @param[in] priority Desired priority level of timer’s interrupt:\n
* CMT_PRIORITY_0: Interrupt is disabled\n
* CMT_PRIORITY_1: Lowest interrupt priority\n
* CMT_PRIORITY_2\n
* CMT_PRIORITY_3\n
* CMT_PRIORITY_4\n
* CMT_PRIORITY_5\n
* CMT_PRIORITY_6\n
* CMT_PRIORITY_7\n
* CMT_PRIORITY_8\n
* CMT_PRIORITY_9\n
* CMT_PRIORITY_10\n
* CMT_PRIORITY_11\n
* CMT_PRIORITY_12\n
* CMT_PRIORITY_13\n
* CMT_PRIORITY_14\n
* CMT_PRIORITY_15: Highest interrupt priority\n
* @retval true  Successful; CMT initialized\n
* @retval false     No free CMT channels available, or invalid settings\n
* @details The R_CMT_CreateOneShotAssignChannelPriority assigns the desired
* CMT channel to the caller with desired interrupt priority level,
* and registers a user callback function to be called upon the compare match event.
* The CMT is configured to generate a compare match after the period specified in the call.
* The timer is shut down after a single compare match event.\n
* @note 1.  Invalid settings\n
* The function will return false if one of the following invalid settings occurs:
* invalid channel, invalid priority, channel was in used, or frequency could not be used.\n
*/
bool R_CMT_CreateOneShotAssignChannelPriority (uint32_t period_us, void (* callback)(void * pdata), uint32_t channel, cmt_priority_t priority)
{
    return cmt_create_priority((1000000/period_us), callback, CMT_RX_MODE_ONE_SHOT, channel, priority);
}
/* End of function R_CMT_CreateOneShotAssignChannelPriority */

